# Outer join operations
In this Notebook you will explore the use of *outer join* operations to identify the absence of relationships between 
rows of tables.

Enable access to the PostgreSQL database engine via [SQL Cell Magic](https://pypi.python.org/pypi/ipython-sql).

In [1]:
%load_ext sql
%sql postgresql://test:test@localhost:5432/tm351test

'Connected: test@tm351test'

As the `doctor` and `patient` tables may have been updated by another Notebook, recreate them.

In [2]:
%%sql
DROP TABLE IF EXISTS patient CASCADE;
DROP TABLE IF EXISTS doctor CASCADE;

CREATE TABLE doctor (
 doctor_id CHAR(3) NOT NULL
  CHECK (doctor_id SIMILAR TO 'd[0-9][0-9]'),
 doctor_name VARCHAR(20) NOT NULL,
 date_of_birth DATE NOT NULL,
 PRIMARY KEY (doctor_id)
 );

CREATE TABLE patient (
  patient_id CHAR(4) NOT NULL
    CHECK (patient_id SIMILAR TO 'p[0-9][0-9][0-9]'),
  patient_name VARCHAR(20) NOT NULL,
  date_of_birth DATE NOT NULL,
  gender CHAR(1) NOT NULL
    CHECK (gender = 'F' OR gender = 'M'),
  height DECIMAL(4,1)
    CHECK (height > 0),
  weight DECIMAL(4,1)
    CHECK (weight > 0),
  doctor_id CHAR(3),
 PRIMARY KEY (patient_id),
 FOREIGN KEY (doctor_id) REFERENCES doctor(doctor_id)
 );

Done.
Done.
Done.
Done.

[]

Populate the tables from files using [Psycopg](http://initd.org/psycopg/docs/index.html), 
a PostgreSQL database adapter for Python.

In [3]:
import psycopg2 as pg
import pandas as pd
import pandas.io.sql as psqlg

In [4]:
# open a connection to the PostgreSQL database tm351test
conn = pg.connect(dbname='tm351test', host='localhost', user='test', password='test', port=5432)
# create a cursor
c = conn.cursor()

# open doctor.dat
io = open('data/doctor.dat', 'r')
# execute the PostgreSQL copy command
c.copy_from(io, 'doctor')
# close doctor.dat
io.close()
# commit transaction
conn.commit()

# open patient+doctor_id.dat
io = open('data/patient+doctor_id.dat', 'r')
# execute the PostgreSQL copy command
c.copy_from(io, 'patient')
# close patient+doctor_id.dat
io.close()
# commit transaction
conn.commit()

# close cursor
c.close()
# close database connection
conn.close()

In [5]:
%%sql
SELECT * FROM doctor;

5 rows affected.

[('d06', 'Gibson', datetime.date(1954, 2, 24)),
 ('d07', 'Paxton', datetime.date(1960, 5, 23)),
 ('d09', 'Tamblin', datetime.date(1972, 12, 22)),
 ('d10', 'Rampton', datetime.date(1980, 9, 25)),
 ('d11', 'Nolan', datetime.date(1988, 4, 1))]

In [6]:
%%sql
SELECT * FROM patient;

17 rows affected.

[('p001', 'Thornton', datetime.date(1980, 1, 22), 'F', Decimal('162.3'), Decimal('71.6'), 'd06'),
 ('p007', 'Tennent', datetime.date(1980, 4, 1), 'M', Decimal('176.8'), Decimal('70.9'), 'd07'),
 ('p008', 'James', datetime.date(1980, 7, 8), 'M', Decimal('167.9'), Decimal('70.5'), 'd07'),
 ('p009', 'Kay', datetime.date(1980, 9, 25), 'F', Decimal('164.7'), Decimal('53.2'), 'd06'),
 ('p015', 'Harris', datetime.date(1980, 12, 4), 'M', Decimal('180.6'), Decimal('64.3'), 'd06'),
 ('p031', 'Rubinstein', datetime.date(1980, 12, 23), 'F', None, None, None),
 ('p037', 'Boswell', datetime.date(1981, 6, 11), 'F', None, None, None),
 ('p038', 'Ming', datetime.date(1981, 9, 23), 'M', Decimal('186.3'), Decimal('85.4'), 'd11'),
 ('p039', 'Maher', datetime.date(1981, 10, 9), 'F', Decimal('161.9'), Decimal('73.0'), 'd11'),
 ('p068', 'Monroe', datetime.date(1981, 10, 21), 'F', Decimal('165.0'), Decimal('62.6'), 'd10'),
 ('p071', 'Harris', datetime.date(1981, 12, 12), 'M', Decimal('186.3'), Decimal('76.7'), 'd10'),
 ('p078', 'Hunt', datetime.date(1982, 2, 25), 'M', Decimal('179.9'), Decimal('74.3'), 'd10'),
 ('p079', 'Dixon', datetime.date(1982, 5, 5), 'F', Decimal('163.9'), Decimal('56.5'), 'd06'),
 ('p080', 'Bell', datetime.date(1982, 6, 11), 'F', Decimal('171.3'), Decimal('49.2'), 'd07'),
 ('p087', 'Reed', datetime.date(1982, 6, 14), 'F', Decimal('160.0'), Decimal('59.1'), 'd07'),
 ('p088', 'Boswell', datetime.date(1982, 8, 23), 'M', Decimal('168.4'), Decimal('91.4'), 'd06'),
 ('p089', 'Jarvis', datetime.date(1982, 11, 9), 'F', Decimal('172.9'), Decimal('53.4'), None)]

The resultant table of a *(inner) join* operation excludes any information about rows in either table that do participate in 
the relationship between the two tables.

In example below, there is no information about doctor `d09` or patients `p031`, `p037` and `p089` in the resultant table.

In [7]:
%%sql
SELECT *
FROM doctor JOIN patient
  ON doctor.doctor_id = patient.doctor_id
ORDER BY doctor.doctor_id, patient_id;

14 rows affected.

[('d06', 'Gibson', datetime.date(1954, 2, 24), 'p001', 'Thornton', datetime.date(1980, 1, 22), 'F', Decimal('162.3'), Decimal('71.6'), 'd06'),
 ('d06', 'Gibson', datetime.date(1954, 2, 24), 'p009', 'Kay', datetime.date(1980, 9, 25), 'F', Decimal('164.7'), Decimal('53.2'), 'd06'),
 ('d06', 'Gibson', datetime.date(1954, 2, 24), 'p015', 'Harris', datetime.date(1980, 12, 4), 'M', Decimal('180.6'), Decimal('64.3'), 'd06'),
 ('d06', 'Gibson', datetime.date(1954, 2, 24), 'p079', 'Dixon', datetime.date(1982, 5, 5), 'F', Decimal('163.9'), Decimal('56.5'), 'd06'),
 ('d06', 'Gibson', datetime.date(1954, 2, 24), 'p088', 'Boswell', datetime.date(1982, 8, 23), 'M', Decimal('168.4'), Decimal('91.4'), 'd06'),
 ('d07', 'Paxton', datetime.date(1960, 5, 23), 'p007', 'Tennent', datetime.date(1980, 4, 1), 'M', Decimal('176.8'), Decimal('70.9'), 'd07'),
 ('d07', 'Paxton', datetime.date(1960, 5, 23), 'p008', 'James', datetime.date(1980, 7, 8), 'M', Decimal('167.9'), Decimal('70.5'), 'd07'),
 ('d07', 'Paxton', datetime.date(1960, 5, 23), 'p080', 'Bell', datetime.date(1982, 6, 11), 'F', Decimal('171.3'), Decimal('49.2'), 'd07'),
 ('d07', 'Paxton', datetime.date(1960, 5, 23), 'p087', 'Reed', datetime.date(1982, 6, 14), 'F', Decimal('160.0'), Decimal('59.1'), 'd07'),
 ('d10', 'Rampton', datetime.date(1980, 9, 25), 'p068', 'Monroe', datetime.date(1981, 10, 21), 'F', Decimal('165.0'), Decimal('62.6'), 'd10'),
 ('d10', 'Rampton', datetime.date(1980, 9, 25), 'p071', 'Harris', datetime.date(1981, 12, 12), 'M', Decimal('186.3'), Decimal('76.7'), 'd10'),
 ('d10', 'Rampton', datetime.date(1980, 9, 25), 'p078', 'Hunt', datetime.date(1982, 2, 25), 'M', Decimal('179.9'), Decimal('74.3'), 'd10'),
 ('d11', 'Nolan', datetime.date(1988, 4, 1), 'p038', 'Ming', datetime.date(1981, 9, 23), 'M', Decimal('186.3'), Decimal('85.4'), 'd11'),
 ('d11', 'Nolan', datetime.date(1988, 4, 1), 'p039', 'Maher', datetime.date(1981, 10, 9), 'F', Decimal('161.9'), Decimal('73.0'), 'd11')]

The resultant table of a *left outer join* operation includes all the rows present in the *left* table specified on 
the `LEFT OUTER JOIN` clause, including those that do not participate in the relationship between the two tables.

In the example below, information about doctor `d09` is included but the patient information is set to `null`.

In [8]:
%%sql
SELECT *
FROM doctor LEFT OUTER JOIN patient
  ON doctor.doctor_id = patient.doctor_id
ORDER BY doctor.doctor_id, patient_id;

15 rows affected.

[('d06', 'Gibson', datetime.date(1954, 2, 24), 'p001', 'Thornton', datetime.date(1980, 1, 22), 'F', Decimal('162.3'), Decimal('71.6'), 'd06'),
 ('d06', 'Gibson', datetime.date(1954, 2, 24), 'p009', 'Kay', datetime.date(1980, 9, 25), 'F', Decimal('164.7'), Decimal('53.2'), 'd06'),
 ('d06', 'Gibson', datetime.date(1954, 2, 24), 'p015', 'Harris', datetime.date(1980, 12, 4), 'M', Decimal('180.6'), Decimal('64.3'), 'd06'),
 ('d06', 'Gibson', datetime.date(1954, 2, 24), 'p079', 'Dixon', datetime.date(1982, 5, 5), 'F', Decimal('163.9'), Decimal('56.5'), 'd06'),
 ('d06', 'Gibson', datetime.date(1954, 2, 24), 'p088', 'Boswell', datetime.date(1982, 8, 23), 'M', Decimal('168.4'), Decimal('91.4'), 'd06'),
 ('d07', 'Paxton', datetime.date(1960, 5, 23), 'p007', 'Tennent', datetime.date(1980, 4, 1), 'M', Decimal('176.8'), Decimal('70.9'), 'd07'),
 ('d07', 'Paxton', datetime.date(1960, 5, 23), 'p008', 'James', datetime.date(1980, 7, 8), 'M', Decimal('167.9'), Decimal('70.5'), 'd07'),
 ('d07', 'Paxton', datetime.date(1960, 5, 23), 'p080', 'Bell', datetime.date(1982, 6, 11), 'F', Decimal('171.3'), Decimal('49.2'), 'd07'),
 ('d07', 'Paxton', datetime.date(1960, 5, 23), 'p087', 'Reed', datetime.date(1982, 6, 14), 'F', Decimal('160.0'), Decimal('59.1'), 'd07'),
 ('d09', 'Tamblin', datetime.date(1972, 12, 22), None, None, None, None, None, None, None),
 ('d10', 'Rampton', datetime.date(1980, 9, 25), 'p068', 'Monroe', datetime.date(1981, 10, 21), 'F', Decimal('165.0'), Decimal('62.6'), 'd10'),
 ('d10', 'Rampton', datetime.date(1980, 9, 25), 'p071', 'Harris', datetime.date(1981, 12, 12), 'M', Decimal('186.3'), Decimal('76.7'), 'd10'),
 ('d10', 'Rampton', datetime.date(1980, 9, 25), 'p078', 'Hunt', datetime.date(1982, 2, 25), 'M', Decimal('179.9'), Decimal('74.3'), 'd10'),
 ('d11', 'Nolan', datetime.date(1988, 4, 1), 'p038', 'Ming', datetime.date(1981, 9, 23), 'M', Decimal('186.3'), Decimal('85.4'), 'd11'),
 ('d11', 'Nolan', datetime.date(1988, 4, 1), 'p039', 'Maher', datetime.date(1981, 10, 9), 'F', Decimal('161.9'), Decimal('73.0'), 'd11')]

We can restrict the resultant table to just those rows present in the *left* table specified on the 
`LEFT OUTER JOIN` clause to those that do not participate in the relationship between the two tables by testing 
whether the *right* table join condition column is `null`.

In [ ]:
%%sql
SELECT *
FROM doctor LEFT OUTER JOIN patient
  ON doctor.doctor_id = patient.doctor_id
WHERE patient.doctor_id IS NULL
ORDER BY doctor.doctor_id, patient_id;

The resultant table of a *right outer join* operation includes all the rows present in the *right* table specified on 
the `RIGHT OUTER JOIN` clause, including those that do not participate in the relationship between the two tables.

In example below, information about patients `p031`, `p037` and `p089` is included but the doctor information is set to `null`.

In [ ]:
%%sql
SELECT *
FROM doctor RIGHT OUTER JOIN patient
  ON doctor.doctor_id = patient.doctor_id
ORDER BY doctor.doctor_id, patient_id;

We can restrict the resultant table to just those rows present in the *right* table specified on the 
`RIGHT OUTER JOIN` clause to those that do not participate in the relationship between the two tables by testing 
whether the *left* table join condition column is `null`.

In [ ]:
%%sql
SELECT *
FROM doctor RIGHT OUTER JOIN patient
  ON doctor.doctor_id = patient.doctor_id
WHERE doctor.doctor_id IS NULL
ORDER BY doctor.doctor_id, patient_id;

The resultant table of a *full outer join* operation includes all the rows present in the *left* and *right* tables 
specified on the `FULL OUTER JOIN` clause, including those that do not participate in the relationship between the 
two tables.

In the example below, information about doctor `d09` is included but the patient information is set to `null`, and information about patients `p031`, `p037` and `p089` is included but the doctor information is set to `null`.

In [ ]:
%%sql
SELECT *
FROM doctor FULL OUTER JOIN patient
  ON doctor.doctor_id = patient.doctor_id
ORDER BY doctor.doctor_id, patient_id;

In [ ]:
%%sql
SELECT *
FROM doctor FULL OUTER JOIN patient
  ON doctor.doctor_id = patient.doctor_id
WHERE patient.doctor_id IS NULL
   OR doctor.doctor_id IS NULL
ORDER BY doctor.doctor_id, patient_id;

## Summary

In this Notebook you have explored the use of *outer join* operations to identify the absence of relationships between 
rows of tables.

## What next?
If you are working through this Notebook as part of an inline exercise, return to the module materials now.

If you are working through this set of Notebooks as a whole, you've completed the Part 10 Notebooks. It's time to move on to Part 11.